# JoistSystemMaximumSpacingParam Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..JoistSystemMaximumSpacingParam Property
ParameterTypeId Class See Also
---
"Maximum Spacing"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId JoistSystemMaximumSpacingParam { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property JoistSystemMaximumSpacingParam As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ JoistSystemMaximumSpacingParam {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace